Revit 2026 API

# CategoryIsBuiltInCategory Method

---

Checks whether a ForgeTypeId identifies a built-in category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsBuiltInCategory(
	ForgeTypeId categoryTypeId
)
```
```vb
Public Shared Function IsBuiltInCategory (
	categoryTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsBuiltInCategory(
	ForgeTypeId^ categoryTypeId
)
```
```fsharp
static member IsBuiltInCategory :
        categoryTypeId : ForgeTypeId -> bool
```

#### Parameters

categoryTypeId ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies a built-in category, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A ForgeTypeId identifies a built-in category if it corresponds to a valid BuiltInCategory value according to Category.IsBuiltInCategoryValid(BuiltInCategory) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).

#### Reference

Category Class

Autodesk.Revit.DB Namespace